Revit 2027 API
BuiltInFailures.RegenFailures.GeomStepFailed Property
 Can't rebuild geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId GeomStepFailed { get; }
Public Shared ReadOnly Property GeomStepFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ GeomStepFailed {
	FailureDefinitionId^ get ();
}
static member GeomStepFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RegenFailures Class
Autodesk.Revit.DB Namespace